In [3]:
import pandas as pd
ser=pd.Series([4,7,-5,3])
ser

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
import pandas as pd
ser=pd.Series([4,7,-5,3])
ser.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
ser=pd.Series([4,7,-5,3])
ser.index
ser.index.array

<PandasArray>
[0, 1, 2, 3]
Length: 4, dtype: int64

In [6]:
ser=pd.Series([4,7,-5,3])
ser.index.to_numpy()

array([0, 1, 2, 3], dtype=int64)

In [7]:
ser=pd.Series([4,7,-5,3])
ser.values

array([ 4,  7, -5,  3], dtype=int64)

In [7]:
ser=pd.Series([4,7,-5,3])
ser.array

<PandasArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [8]:
ser=pd.Series([4,7,-5,3])
ser.to_numpy()

array([ 4,  7, -5,  3], dtype=int64)

In [9]:
ser=pd.Series([4,7,-5,3])
print(ser.dtype)
print(ser.shape)
print(ser.ndim)
print(ser.size)

int64
(4,)
1
4

In [10]:
ser=pd.Series([4,7,-5,3])
ser.name='data'
ser

0    4
1    7
2   -5
3    3
Name: data, dtype: int64

In [4]:
import pandas as pd
ser_2=pd.Series([4,7,-5,3],index=['a','b','b','c'])
ser_2

a    4
b    7
b   -5
c    3
dtype: int64

In [5]:
ser_2=pd.Series([4,7,-5,3],index=['a','b','b','c'])
ser_2.index

Index(['a', 'b', 'b', 'c'], dtype='object')

In [6]:
ser_2=pd.Series([4,7,-5,3],index=['a','b','b','c'])
ser_2['b']

b    7
b   -5
dtype: int64

In [8]:
ser_2=pd.Series([4,7,-5,3],index=['a','b','b','c'])
ser_2[['a','b']]

a    4
b    7
b   -5
dtype: int64

In [9]:
ser_2=pd.Series([4,7,-5,3],index=['a','b','b','c'])
ser_2['b']='s'
ser_2

a    4
b    s
b    s
c    3
dtype: object

In [10]:
dic_3={'two':9000,'one':9001,'three':9002,'four':9003}
ser_3=pd.Series(dic_3)
ser_3

two      9000
one      9001
three    9002
four     9003
dtype: int64

In [11]:
dic_3={'two':9000,'one':9001,'three':9002,'four':9003}
dic_index=['two','three','four']
ser_3=pd.Series(dic_3,index=dic_index)
ser_3

two      9000
three    9002
four     9003
dtype: int64

In [13]:
dic_3={'two':9000,'one':9001,'three':9002,'four':9003}
dic_index=['zero','one','two','three','four','five']
ser_3=pd.Series(dic_3,index=dic_index)
ser_3

zero        NaN
one      9001.0
two      9000.0
three    9002.0
four     9003.0
five        NaN
dtype: float64

In [14]:
dic_3={'two':9000,'one':9001,'three':9002,'four':9003}
dic_index=['zero','one','two','three','four','five']
ser_3=pd.Series(dic_3,index=dic_index)
pd.isnull(ser_3)

zero      True
one      False
two      False
three    False
four     False
five      True
dtype: bool

In [15]:
dic_3={'two':9000,'one':9001,'three':9002,'four':9003}
dic_index=['zero','one','two','three','four','five']
ser_3=pd.Series(dic_3,index=dic_index)
pd.notnull(ser_3)

zero     False
one       True
two       True
three     True
four      True
five     False
dtype: bool

In [17]:
dic_3={'two':9000,'one':9001,'three':9002,'four':9003}
dic_index=['zero','one','two','three','four','five']
ser_3=pd.Series(dic_3,index=dic_index)
ser_3.index=[0,1,2,3,4,5]
ser_3

0       NaN
1    9001.0
2    9000.0
3    9002.0
4    9003.0
5       NaN
dtype: float64

In [18]:
ser_1=pd.Series([1,2,3,4,5])
ser_2=pd.Series([2,3,4,5])
ser_1+ser_2

0    3.0
1    5.0
2    7.0
3    9.0
4    NaN
dtype: float64

In [19]:
ser_1=pd.Series([1,2,3,4,5])
ser_2=pd.Series([2,3,4,5])
ser_1*ser_2

0     2.0
1     6.0
2    12.0
3    20.0
4     NaN
dtype: float64

In [21]:
ser_1=pd.Series([1,2,3,4,5])
print(ser_1[ser_1.index>3])
print(ser_1[ser_1.array>3])

4    5
dtype: int64
3    4
4    5
dtype: int64

In [22]:
import numpy as np
ser_1=pd.Series([1,2,3,4,5])
np.sin(ser_1)

0    0.841471
1    0.909297
2    0.141120
3   -0.756802
4   -0.958924
dtype: float64

In [23]:
import numpy as np
ser_1=pd.Series([1,2,3,4,5])
0 in ser_1

True

In [24]:
import numpy as np
ser_1=pd.Series([1,2,3,4,5])
10 in ser_1

False

In [28]:
s2=pd.Series({'语文':90,'数学':92,'Python':98,'物理':87,'化学':92})

print('平均值:',s2.mean(),sep='\n')
print('s2中最小的2个数：',s2.nsmallest(2),sep='\n')
print('对Series对象中的元素应用函数：',s2.apply(lambda x:x+2),sep='\n')
print('对Series对象中的元素应用函数：',s2.apply(np.log),sep='\n')

平均值:
91.8
s2中最小的2个数：
物理    87
语文    90
dtype: int64
对Series对象中的元素应用函数：
语文         92
数学         94
Python    100
物理         89
化学         94
dtype: int64
对Series对象中的元素应用函数：
语文        4.499810
数学        4.521789
Python    4.584967
物理        4.465908
化学        4.521789
dtype: float64

In [34]:
import pandas as pd
pd.date_range('20200801','20200810')

DatetimeIndex(['2020-08-01', '2020-08-02', '2020-08-03', '2020-08-04',
               '2020-08-05', '2020-08-06', '2020-08-07', '2020-08-08',
               '2020-08-09', '2020-08-10'],
              dtype='datetime64[ns]', freq='D')

In [35]:
import pandas as pd
pd.date_range(start='20200801',periods=10)

DatetimeIndex(['2020-08-01', '2020-08-02', '2020-08-03', '2020-08-04',
               '2020-08-05', '2020-08-06', '2020-08-07', '2020-08-08',
               '2020-08-09', '2020-08-10'],
              dtype='datetime64[ns]', freq='D')

In [36]:
pd.date_range(end='20200801',periods=10)

DatetimeIndex(['2020-07-23', '2020-07-24', '2020-07-25', '2020-07-26',
               '2020-07-27', '2020-07-28', '2020-07-29', '2020-07-30',
               '2020-07-31', '2020-08-01'],
              dtype='datetime64[ns]', freq='D')

In [37]:
import pandas as pd
pd.date_range('20200801','20200810',freq='D')

DatetimeIndex(['2020-08-01', '2020-08-02', '2020-08-03', '2020-08-04',
               '2020-08-05', '2020-08-06', '2020-08-07', '2020-08-08',
               '2020-08-09', '2020-08-10'],
              dtype='datetime64[ns]', freq='D')

In [38]:
index=pd.date_range(start='2020-1-15',periods=10,freq='H')
ts=pd.Series(np.arange(0,10),index)
ts

2020-01-15 00:00:00    0
2020-01-15 01:00:00    1
2020-01-15 02:00:00    2
2020-01-15 03:00:00    3
2020-01-15 04:00:00    4
2020-01-15 05:00:00    5
2020-01-15 06:00:00    6
2020-01-15 07:00:00    7
2020-01-15 08:00:00    8
2020-01-15 09:00:00    9
Freq: H, dtype: int32

In [39]:
index=pd.date_range(start='2020-1-15',periods=10,freq='H')
ts=pd.Series(np.arange(0,10),index)
print(ts.resample('2H').sum())

2020-01-15 00:00:00     1
2020-01-15 02:00:00     5
2020-01-15 04:00:00     9
2020-01-15 06:00:00    13
2020-01-15 08:00:00    17
Freq: 2H, dtype: int32

In [40]:
index=pd.date_range(start='2020-1-15',periods=10,freq='H')
ts=pd.Series(np.arange(0,10),index)
print(ts.resample('2H',label='right').sum())

2020-01-15 02:00:00     1
2020-01-15 04:00:00     5
2020-01-15 06:00:00     9
2020-01-15 08:00:00    13
2020-01-15 10:00:00    17
Freq: 2H, dtype: int32

In [41]:
index=pd.date_range(start='2020-1-15',periods=10,freq='H')
ts=pd.Series(np.arange(0,10),index)
print(ts.resample('2H').mean())

2020-01-15 00:00:00    0.5
2020-01-15 02:00:00    2.5
2020-01-15 04:00:00    4.5
2020-01-15 06:00:00    6.5
2020-01-15 08:00:00    8.5
Freq: 2H, dtype: float64

In [42]:
index=pd.date_range(start='2020-1-15',periods=10,freq='H')
print(pd.Series(index))

0   2020-01-15 00:00:00
1   2020-01-15 01:00:00
2   2020-01-15 02:00:00
3   2020-01-15 03:00:00
4   2020-01-15 04:00:00
5   2020-01-15 05:00:00
6   2020-01-15 06:00:00
7   2020-01-15 07:00:00
8   2020-01-15 08:00:00
9   2020-01-15 09:00:00
dtype: datetime64[ns]

In [43]:
t1=pd.Timestamp('2019-01-10')
t2=pd.Timestamp('2018-12-10')
print(t1,t2,sep='\n')
print('t1与t2的时间间隔：：',t1-t2)

2019-01-10 00:00:00
2018-12-10 00:00:00
t1与t2的时间间隔：： 31 days 00:00:00

In [46]:
pd.Timedelta(days=5,minutes=50,seconds=20,milliseconds=10,microseconds=10,nanoseconds=10)

Timedelta('5 days 00:50:20.010010010')

In [47]:
t1=pd.Timestamp('2019-01-10')
t2=t1+pd.Timedelta(days=100)
print(t2)

2019-04-20 00:00:00

In [48]:
t1=pd.Timestamp('2019-01-10')
print(t1.month,t1.day,t1.month_name(),t1.day_name())

1 10 January Thursday

In [50]:
data=[1,2,3,4,5]
df=pd.DataFrame(data)
print(df)

   0
0  1
1  2
2  3
3  4
4  5

In [57]:
data=[['Alex',10],['Bob',12],['Clarke',13]]
df=pd.DataFrame(data,columns=['Name','Age'],dtype=float)
print(df)

     Name   Age
0    Alex  10.0
1     Bob  12.0
2  Clarke  13.0

In [56]:
data=[['Alex',10],['Bob',12],['Clarke',13]]
df=pd.DataFrame(data,columns=['Name','Age'],dtype=float)
df.index

RangeIndex(start=0, stop=3, step=1)

In [54]:
data=[['Alex',10],['Bob',12],['Clarke',13]]
df=pd.DataFrame(data,columns=['Name','Age'],dtype=float)
df.columns

Index(['Name', 'Age'], dtype='object')

In [55]:
data=[['Alex',10],['Bob',12],['Clarke',13]]
df=pd.DataFrame(data,columns=['Name','Age'],dtype=float)
df.values

array([['Alex', 10.0],
       ['Bob', 12.0],
       ['Clarke', 13.0]], dtype=object)

In [58]:
df=pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9]]))
print(df)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [61]:
df=pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9]]),columns=['a','b','c'],index=['1','2','3'])
print(df)

   a  b  c
1  1  2  3
2  4  5  6
3  7  8  9

In [62]:
data=[{'a':1,'b':2},{'a':5,'b':10,'c':20}]
df=pd.DataFrame(data,index=['s','d'])
print(df)

   a   b     c
s  1   2   NaN
d  5  10  20.0

In [63]:
data={'Name':['Tom','Jack','Steve','Ricky'],'Age':[28,34,29,42]}
df=pd.DataFrame(data,index=['rank1','rank2','rank3','rank4'])
print(df)

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

In [65]:
data={'Name':['Tom','Jack','Steve','Ricky'],'Age':[28,34,29,42],'Sex':['男','男','男','男']}
df=pd.DataFrame(data).set_index('Name')
print(df)

       Age Sex
Name
Tom     28   男
Jack    34   男
Steve   29   男
Ricky   42   男

In [66]:
d={'one':pd.Series([1,2,3],index=['a','b','c']),
  'two':pd.Series([1,2,3,4],index=['a','b','c','d'])}
df=pd.DataFrame(d)
print(df)

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [71]:
data={'Name':['Tom','Jack','Steve','Ricky'],'Age':[28,34,29,42]}
df=pd.DataFrame(data,index=['rank1','rank2','rank3','rank4'])
print(df,end='\n')

print('行选取，整数索引切片：',df[0:2],sep='\n',end='\n')
print('行选取，标签索引切片：',df['rank1':'rank3'],sep='\n',end='\n')
print('行选取，布尔索引：',df[[True,True,False,False]],sep='\n',end='\n')
print('行选取，布尔索引：',df[df['Age']>30],sep='\n',end='\n')

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42
行选取，整数索引切片：
       Name  Age
rank1   Tom   28
rank2  Jack   34
行选取，标签索引切片：
        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
行选取，布尔索引：
       Name  Age
rank1   Tom   28
rank2  Jack   34
行选取，布尔索引：
        Name  Age
rank2   Jack   34
rank4  Ricky   42

In [2]:
import pandas as pd
data={'Name':['Tom','Jack','Steve','Ricky'],'Age':[28,34,29,42]}
df=pd.DataFrame(data,index=['rank1','rank2','rank3','rank4'])
print(df,end='\n')
print('列选取，标签索引：',df['Name'],sep='\n',end='\n')
print('列选取，标签列表选择多个列：',df[['Name','Age']],sep='\n',end='\n')

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42
列选取，标签索引：
rank1      Tom
rank2     Jack
rank3    Steve
rank4    Ricky
Name: Name, dtype: object
列选取，标签列表选择多个列：
        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

In [4]:
import pandas as pd
data={'Name':['Tom','Jack','Steve','Ricky'],'Age':[28,34,29,42]}
df=pd.DataFrame(data,index=['rank1','rank2','rank3','rank4'])
print(df,end='\n')
print('区域的选择，通过行列选择：',df[2:]['Age'],sep='\n',end='\n')
print('区域的选择，通过行列选择：',df['Age'][2:],sep='\n',end='\n')
print('区域的选择，通过行列选择：',df[df['Age']>30]['Name'],sep='\n',end='\n')

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42
区域的选择，通过行列选择：
rank3    29
rank4    42
Name: Age, dtype: int64
区域的选择，通过行列选择：
rank3    29
rank4    42
Name: Age, dtype: int64
区域的选择，通过行列选择：
rank2     Jack
rank4    Ricky
Name: Name, dtype: object

In [6]:

data={'Name':['Tom','Jack','Steve','Ricky'],'Age':[28,34,29,42]}
df=pd.DataFrame(data,index=['rank1','rank2','rank3','rank4'])
print(df,end='\n')
print('区域的选择，通过df.loc选择：',df.loc['rank2':,['Age','Name']],sep='\n',end='\n')
print('区域的选择，通过行列选择：',df.iloc[:2,0],sep='\n',end='\n')
print('区域的选择，通过行列选择：',df.iloc[[1,3],0],sep='\n',end='\n')

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42
区域的选择，通过df.loc选择：
       Age   Name
rank2   34   Jack
rank3   29  Steve
rank4   42  Ricky
区域的选择，通过行列选择：
rank1     Tom
rank2    Jack
Name: Name, dtype: object
区域的选择，通过行列选择：
rank2     Jack
rank4    Ricky
Name: Name, dtype: object

In [8]:
data={'Name':['Tom','Jack','Steve','Ricky'],'Age':[28,34,29,42]}
df=pd.DataFrame(data,index=['rank1','rank2','rank3','rank4'])
print(df,end='\n')
print('某个数值的选取，通过df',df.at['rank2','Age'],sep='\n',end='\n')
print('某个数值的选取，通过df',df.iat[1,1],sep='\n',end='\n')

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42
某个数值的选取，通过df
34
某个数值的选取，通过df
34

In [13]:
pd.set_option('display.unicode.ambiguous_as_wide',True)
pd.set_option('display.unicode.east_asian_width',True)

df=pd.read_excel(r'F:\超市营业额.xlsx',sheet_name='Sheet1')
print(df)
print('交易额的最大值：',df['交易额'].max())
print('交易额的最小值：',df['交易额'].min())
print('交易额和：',df['交易额'].sum())
print('交易额的平均值：',df['交易额'].mean())
print('交易额的统计信息：',df['交易额'].describe(),sep='\n')

   工号  姓名       日期         时段  交易额      柜台
0  1001  张三 2019-04-01   9:00-14:00    1369    化妆品
1  1002  李四 2019-04-01  14:00-21:00    1005    化妆品
2  1003  王五 2019-04-01   9:00-14:00    1460      食品
3  1004  赵六 2019-04-01  14:00-21:00    1270      食品
4  1005  周七 2019-04-01   9:00-14:00    1123    日用品
5  1006  钱八 2019-04-01  14:00-21:00    1321    日用品
6  1007  孙九 2019-04-01   9:00-14:00    1633  蔬菜水果
7  1007  孙九 2019-04-01  14:00-21:00    1364  蔬菜水果
交易额的最大值： 1633
交易额的最小值： 1005
交易额和： 10545
交易额的平均值： 1318.125
交易额的统计信息：
count       8.000000
mean     1318.125000
std       193.617028
min      1005.000000
25%      1233.250000
50%      1342.500000
75%      1391.750000
max      1633.000000
Name: 交易额, dtype: float64

In [18]:
df=pd.DataFrame({'A':[3,3,3,3,3],'B':[1,2,3,4,5],'C':[-5,-4,15,4,5],'D':[-50,-40,15,40,50]})
print('原始数据:---',sep='\n')
print(df)
print('平均值:---',sep='\n')
print(df.mean())
print('标准差:---',sep='\n')
print(df.std())
print('标准差的平方:---',sep='\n')
print(df.std()**2)
print('协方差:---',sep='\n')
print(df.cov())

原始数据:---
   A  B   C   D
0  3  1  -5 -50
1  3  2  -4 -40
2  3  3  15  15
3  3  4   4  40
4  3  5   5  50
平均值:---
A    3.0
B    3.0
C    3.0
D    3.0
dtype: float64
标准差:---
A     0.000000
B     1.581139
C     8.093207
D    45.771170
dtype: float64
标准差的平方:---
A       0.0
B       2.5
C      65.5
D    2095.0
dtype: float64
协方差:---
     A     B      C       D
A  0.0   0.0    0.0     0.0
B  0.0   2.5    7.0    70.0
C  0.0   7.0   65.5   250.0
D  0.0  70.0  250.0  2095.0

In [20]:
df=pd.DataFrame({'b':[1,2,3,2],'a':[4,3,2,1],'c':[1,3,8,2]},index=[2,0,1,3])
df

   b  a  c
2  1  4  1
0  2  3  3
1  3  2  8
3  2  1  2

In [21]:
df=pd.DataFrame({'b':[1,2,3,2],'a':[4,3,2,1],'c':[1,3,8,2]},index=[2,0,1,3])
df.sort_index()

   b  a  c
0  2  3  3
1  3  2  8
2  1  4  1
3  2  1  2

In [22]:
df=pd.DataFrame({'b':[1,2,3,2],'a':[4,3,2,1],'c':[1,3,8,2]},index=[2,0,1,3])
df.sort_index(axis=1)  #按照列标签进行排序

   a  b  c
2  4  1  1
0  3  2  3
1  2  3  8
3  1  2  2

In [23]:
df=pd.DataFrame({'b':[1,2,3,2],'a':[4,3,2,1],'c':[1,3,8,2]},index=[2,0,1,3])
df.sort_index(axis=1,ascending=False)

   c  b  a
2  1  1  4
0  3  2  3
1  8  3  2
3  2  2  1

In [24]:
df=pd.DataFrame({'b':[1,2,3,2],'a':[4,3,2,1],'c':[1,3,8,2]},index=[2,0,1,3])
df.sort_values(by='b')

   b  a  c
2  1  4  1
0  2  3  3
3  2  1  2
1  3  2  8

In [28]:
df=pd.DataFrame({'b':[1,2,3,2],'a':[4,3,2,1],'c':[1,3,8,2]},index=[2,0,1,3])
df.sort_values(by=['b','a'],ascending=[False,True])

   b  a  c
1  3  2  8
3  2  1  2
0  2  3  3
2  1  4  1

In [8]:
df=pd.DataFrame({'b':[1,2,3,2],'a':[4,3,2,1],'c':[1,3,8,2]},index=[2,0,1,3])
df.sort_values(by=[3,0],axis=1,ascending=[True,False])

   a  c  b
2  4  1  1
0  3  3  2
1  2  8  3
3  1  2  2

In [9]:
import numpy as np
import pandas as pd
company=["A","B","C"]
data=pd.DataFrame({
    "company":[company[x] for x in np.random.randint(0,len(company),10)],
    "salary":np.random.randint(5,50,10),
    "age":np.random.randint(15,50,10)
    
}
)
data

  company  salary  age
0       A      20   20
1       A      14   28
2       A      10   34
3       B      30   22
4       B       7   38
5       C      46   34
6       B      33   44
7       A      15   43
8       C      39   47
9       A      42   37

In [13]:
import numpy as np
company=["A","B","C"]
data=pd.DataFrame({
    "company":[company[x] for x in np.random.randint(0,len(company),10)],
    "salary":np.random.randint(5,50,10),
    "age":np.random.randint(15,50,10)
    
}
)
group=data.groupby("company")
group

In [11]:
list(group)

[('A',
    company  salary  age
  0       A      28   27
  1       A      40   32
  2       A      32   16
  5       A      19   44
  6       A      18   23),
 ('B',
    company  salary  age
  4       B      47   41
  8       B      16   23
  9       B      26   22),
 ('C',
    company  salary  age
  3       C      47   34
  7       C      34   26)]

In [14]:
import numpy as np
company=["A","B","C"]
data=pd.DataFrame({
    "company":[company[x] for x in np.random.randint(0,len(company),10)],
    "salary":np.random.randint(5,50,10),
    "age":np.random.randint(15,50,10)
    
}
)
group=data.groupby('company').agg('mean')
group

            salary   age
company
A        29.000000  25.0
B        21.333333  36.5
C        19.000000  24.0

In [16]:
import numpy as np
company=["A","B","C"]
data=pd.DataFrame({
    "company":[company[x] for x in np.random.randint(0,len(company),10)],
    "salary":np.random.randint(5,50,10),
    "age":np.random.randint(15,50,10)
    
}
)
group=data.groupby('company').agg({'salary':'median','age':'max'})
group

         salary  age
company
A          37.5   44
B          25.0   36
C          21.0   41

In [17]:
pd.set_option('display.unicode.ambiguous_as_wide',True)
pd.set_option('display.unicode.east_asian_width',True)

df=pd.read_excel(r'F:\超市营业额2.xlsx',sheet_name='Sheet1')
print(df.head())
df.shape

   工号  姓名        日期           时段  交易额    柜台
0  1001  张三  2019-03-01   9：00-14：00  1664.0  化妆品
1  1002  李四  2019-03-01  14：00-21：00   954.0  化妆品
2  1003  王五  2019-03-01   9：00-14：00  1407.0    食品
3  1004  赵六  2019-03-01  14：00-21：00  1320.0    食品
4  1005  周七  2019-03-01   9：00-14：00   994.0  日用品

(249, 6)

In [19]:
pd.set_option('display.unicode.ambiguous_as_wide',True)
pd.set_option('display.unicode.east_asian_width',True)

df=pd.read_excel(r'F:\超市营业额2.xlsx',sheet_name='Sheet1')
print(df[df['交易额']>5000])

     工号  姓名        日期          时段   交易额    柜台
105  1001  张三  2019-03-14  9：00-14：00  12100.0  日用品
223  1003  王五  2019-03-28  9：00-14：00   9031.0    食品

In [20]:
#删除异常值所在的行和列
list_pop=df[df['交易额']>5000].index
new_df=df.drop(index=list_pop)
new_df.shape

(247, 6)

In [21]:

df.loc[df['交易额']>5000,'交易额']=5000
print(df[df['交易额']>=5000])

     工号  姓名        日期          时段  交易额    柜台
105  1001  张三  2019-03-14  9：00-14：00  5000.0  日用品
223  1003  王五  2019-03-28  9：00-14：00  5000.0    食品

In [25]:
df=pd.read_excel(r'F:\超市营业额2.xlsx',sheet_name='Sheet1')
df.isnull()

      工号   姓名   日期   时段  交易额   柜台
0    False  False  False  False   False  False
1    False  False  False  False   False  False
2    False  False  False  False   False  False
3    False  False  False  False   False  False
4    False  False  False  False   False  False
..     ...    ...    ...    ...     ...    ...
244  False  False  False  False   False  False
245  False  False  False  False   False  False
246  False  False  False  False   False  False
247  False  False  False  False   False  False
248  False  False  False  False   False  False

[249 rows x 6 columns]

In [27]:
Series_null=df.isnull().any(axis=1)
print(Series_null[Series_null==True])

Series_null=df.isnull().any(axis=0)
Series_null[Series_null==True]

110    True
124    True
168    True
dtype: bool

交易额    True
dtype: bool

In [28]:
print(df.iloc[[110,124,168],:])

     工号  姓名        日期           时段  交易额    柜台
110  1005  周七  2019-03-14  14：00-21：00     NaN  化妆品
124  1006  钱八  2019-03-16  14：00-21：00     NaN    食品
168  1005  周七  2019-03-21  14：00-21：00     NaN    食品

In [29]:
df=pd.read_excel(r'F:\超市营业额2.xlsx',sheet_name='Sheet1')
print(df.shape)
new_df=df.dropna()
print(new_df.shape)

(249, 6)
(246, 6)

In [30]:
print(df.iloc[[110,124,168],:])

     工号  姓名        日期           时段  交易额    柜台
110  1005  周七  2019-03-14  14：00-21：00     NaN  化妆品
124  1006  钱八  2019-03-16  14：00-21：00     NaN    食品
168  1005  周七  2019-03-21  14：00-21：00     NaN    食品

In [31]:

new_df=df.fillna(round(df['交易额'].mean()*0.8),inplace=False)
print(new_df.iloc[[110,124,168],:])

     工号  姓名        日期           时段  交易额    柜台
110  1005  周七  2019-03-14  14：00-21：00  1064.0  化妆品
124  1006  钱八  2019-03-16  14：00-21：00  1064.0    食品
168  1005  周七  2019-03-21  14：00-21：00  1064.0    食品

In [33]:

df=pd.read_excel(r'F:\超市营业额2.xlsx',sheet_name='Sheet1')
df[df.duplicated(keep=False)]

     工号  姓名        日期           时段  交易额      柜台
103  1006  钱八  2019-03-13  14：00-21：00  1609.0  蔬菜水果
104  1006  钱八  2019-03-13  14：00-21：00  1609.0  蔬菜水果

In [34]:
new_df=df.drop_duplicates()
new_df.shape

(248, 6)

In [38]:

df=pd.DataFrame({'类别':['水果','水果','水果','蔬菜','蔬菜','肉类','肉类'],
                '产地':['美国','中国','中国','中国','新西兰','新西兰','美国'],
               '项目名称':['苹果','梨','草莓','番茄','黄瓜','羊肉','牛肉'],
               '数量':[5,5,9,3,2,10,8],
               '价格':[5,5,10,3,3,13,20]
                })
df

   类别    产地 项目名称  数量  价格
0  水果    美国     苹果     5     5
1  水果    中国       梨     5     5
2  水果    中国     草莓     9    10
3  蔬菜    中国     番茄     3     3
4  蔬菜  新西兰     黄瓜     2     3
5  肉类  新西兰     羊肉    10    13
6  肉类    美国     牛肉     8    20

In [39]:
df.pivot(index='产地',columns='项目名称',values='价格')

项目名称   梨  牛肉  番茄  羊肉  苹果  草莓  黄瓜
产地
中国      5.0   NaN   3.0   NaN   NaN  10.0   NaN
新西兰    NaN   NaN   NaN  13.0   NaN   NaN   3.0
美国      NaN  20.0   NaN   NaN   5.0   NaN   NaN

In [40]:
df.pivot_table(df,index=['产地','类别'],aggfunc='sum',margins=True)

             价格  数量
产地   类别
中国   水果    15    14
       蔬菜     3     3
新西兰 肉类    13    10
       蔬菜     3     2
美国   水果     5     5
       肉类    20     8
All            59    42

In [42]:
df=pd.DataFrame({'类别':['水果','水果','水果','蔬菜','蔬菜','肉类','肉类'],
                '产地':['美国','中国','中国','中国','新西兰','新西兰','美国'],
               '项目名称':['苹果','梨','草莓','番茄','黄瓜','羊肉','牛肉'],
               '数量':[5,5,9,3,2,10,8],
               '价格':[5,5,10,3,3,13,20]})
df

   类别    产地 项目名称  数量  价格
0  水果    美国     苹果     5     5
1  水果    中国       梨     5     5
2  水果    中国     草莓     9    10
3  蔬菜    中国     番茄     3     3
4  蔬菜  新西兰     黄瓜     2     3
5  肉类  新西兰     羊肉    10    13
6  肉类    美国     牛肉     8    20

In [44]:
df.pivot_table(values='价格',index='产地',columns='类别',aggfunc='max',margins=True,fill_value=0,margins_name='总数')

类别    水果  肉类  蔬菜  总数
产地
中国      10     0     3    10
新西兰     0    13     3    13
美国       5    20     0    20
总数      10    20     3    20

In [45]:
pd.crosstab(df['产地'],df['类别'],margins=True)

类别    水果  肉类  蔬菜  All
产地
中国       2     0     1    3
新西兰     0     1     1    2
美国       1     1     0    2
All        3     2     2    7